MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR176/mcu.h
extern volatile __GLCDCLUT222bits_t GLCDCLUT222bits __asm__ ("GLCDCLUT222") __attribute__((section("sfrs"), address(0xBF8EA778)));
#define GLCDCLUT223 GLCDCLUT223
extern volatile uint32_t   GLCDCLUT223 __attribute__((section("sfrs"), address(0xBF8EA77C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT223bits_t;
extern volatile __GLCDCLUT223bits_t GLCDCLUT223bits __asm__ ("GLCDCLUT223") __attribute__((section("sfrs"), address(0xBF8EA77C)));
#define GLCDCLUT224 GLCDCLUT224
extern volatile uint32_t   GLCDCLUT224 __attribute__((section("sfrs"), address(0xBF8EA780)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT224bits_t;
extern volatile __GLCDCLUT224bits_t GLCDCLUT224bits __asm__ ("GLCDCLUT224") __attribute__((section("sfrs"), address(0xBF8EA780)));
#define GLCDCLUT225 GLCDCLUT225
extern volatile uint32_t   GLCDCLUT225 __attribute__((section("sfrs"), address(0xBF8EA784)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT225bits_t;
extern volatile __GLCDCLUT225bits_t GLCDCLUT225bits __asm__ ("GLCDCLUT225") __attribute__((section("sfrs"), address(0xBF8EA784)));
#define GLCDCLUT226 GLCDCLUT226
extern volatile uint32_t   GLCDCLUT226 __attribute__((section("sfrs"), address(0xBF8EA788)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT226bits_t;
extern volatile __GLCDCLUT226bits_t GLCDCLUT226bits __asm__ ("GLCDCLUT226") __attribute__((section("sfrs"), address(0xBF8EA788)));
#define GLCDCLUT227 GLCDCLUT227
extern volatile uint32_t   GLCDCLUT227 __attribute__((section("sfrs"), address(0xBF8EA78C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT227bits_t;
extern volatile __GLCDCLUT227bits_t GLCDCLUT227bits __asm__ ("GLCDCLUT227") __attribute__((section("sfrs"), address(0xBF8EA78C)));
#define GLCDCLUT228 GLCDCLUT228
extern volatile uint32_t   GLCDCLUT228 __attribute__((section("sfrs"), address(0xBF8EA790)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT228bits_t;
extern volatile __GLCDCLUT228bits_t GLCDCLUT228bits __asm__ ("GLCDCLUT228") __attribute__((section("sfrs"), address(0xBF8EA790)));
#define GLCDCLUT229 GLCDCLUT229
extern volatile uint32_t   GLCDCLUT229 __attribute__((section("sfrs"), address(0xBF8EA794)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT229bits_t;
extern volatile __GLCDCLUT229bits_t GLCDCLUT229bits __asm__ ("GLCDCLUT229") __attribute__((section("sfrs"), address(0xBF8EA794)));
#define GLCDCLUT230 GLCDCLUT230
extern volatile uint32_t   GLCDCLUT230 __attribute__((section("sfrs"), address(0xBF8EA798)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT230bits_t;
extern volatile __GLCDCLUT230bits_t GLCDCLUT230bits __asm__ ("GLCDCLUT230") __attribute__((section("sfrs"), address(0xBF8EA798)));
#define GLCDCLUT231 GLCDCLUT231
extern volatile uint32_t   GLCDCLUT231 __attribute__((section("sfrs"), address(0xBF8EA79C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT231bits_t;
extern volatile __GLCDCLUT231bits_t GLCDCLUT231bits __asm__ ("GLCDCLUT231") __attribute__((section("sfrs"), address(0xBF8EA79C)));
#define GLCDCLUT232 GLCDCLUT232
extern volatile uint32_t   GLCDCLUT232 __attribute__((section("sfrs"), address(0xBF8EA7A0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT232bits_t;
extern volatile __GLCDCLUT232bits_t GLCDCLUT232bits __asm__ ("GLCDCLUT232") __attribute__((section("sfrs"), address(0xBF8EA7A0)));
#define GLCDCLUT233 GLCDCLUT233
extern volatile uint32_t   GLCDCLUT233 __attribute__((section("sfrs"), address(0xBF8EA7A4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT233bits_t;
extern volatile __GLCDCLUT233bits_t GLCDCLUT233bits __asm__ ("GLCDCLUT233") __attribute__((section("sfrs"), address(0xBF8EA7A4)));
#define GLCDCLUT234 GLCDCLUT234
extern volatile uint32_t   GLCDCLUT234 __attribute__((section("sfrs"), address(0xBF8EA7A8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT234bits_t;
extern volatile __GLCDCLUT234bits_t GLCDCLUT234bits __asm__ ("GLCDCLUT234") __attribute__((section("sfrs"), address(0xBF8EA7A8)));
#define GLCDCLUT235 GLCDCLUT235
extern volatile uint32_t   GLCDCLUT235 __attribute__((section("sfrs"), address(0xBF8EA7AC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT235bits_t;
extern volatile __GLCDCLUT235bits_t GLCDCLUT235bits __asm__ ("GLCDCLUT235") __attribute__((section("sfrs"), address(0xBF8EA7AC)));
#define GLCDCLUT236 GLCDCLUT236
extern volatile uint32_t   GLCDCLUT236 __attribute__((section("sfrs"), address(0xBF8EA7B0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT236bits_t;
extern volatile __GLCDCLUT236bits_t GLCDCLUT236bits __asm__ ("GLCDCLUT236") __attribute__((section("sfrs"), address(0xBF8EA7B0)));
#define GLCDCLUT237 GLCDCLUT237
extern volatile uint32_t   GLCDCLUT237 __attribute__((section("sfrs"), address(0xBF8EA7B4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT237bits_t;
extern volatile __GLCDCLUT237bits_t GLCDCLUT237bits __asm__ ("GLCDCLUT237") __attribute__((section("sfrs"), address(0xBF8EA7B4)));
#define GLCDCLUT238 GLCDCLUT238
extern volatile uint32_t   GLCDCLUT238 __attribute__((section("sfrs"), address(0xBF8EA7B8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT238bits_t;
extern volatile __GLCDCLUT238bits_t GLCDCLUT238bits __asm__ ("GLCDCLUT238") __attribute__((section("sfrs"), address(0xBF8EA7B8)));
#define GLCDCLUT239 GLCDCLUT239
extern volatile uint32_t   GLCDCLUT239 __attribute__((section("sfrs"), address(0xBF8EA7BC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT239bits_t;
extern volatile __GLCDCLUT239bits_t GLCDCLUT239bits __asm__ ("GLCDCLUT239") __attribute__((section("sfrs"), address(0xBF8EA7BC)));
#define GLCDCLUT240 GLCDCLUT240
extern volatile uint32_t   GLCDCLUT240 __attribute__((section("sfrs"), address(0xBF8EA7C0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT240bits_t;
extern volatile __GLCDCLUT240bits_t GLCDCLUT240bits __asm__ ("GLCDCLUT240") __attribute__((section("sfrs"), address(0xBF8EA7C0)));
#define GLCDCLUT241 GLCDCLUT241
extern volatile uint32_t   GLCDCLUT241 __attribute__((section("sfrs"), address(0xBF8EA7C4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT241bits_t;
extern volatile __GLCDCLUT241bits_t GLCDCLUT241bits __asm__ ("GLCDCLUT241") __attribute__((section("sfrs"), address(0xBF8EA7C4)));
#define GLCDCLUT242 GLCDCLUT242
extern volatile uint32_t   GLCDCLUT242 __attribute__((section("sfrs"), address(0xBF8EA7C8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT242bits_t;
