MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR176/mcu.h
#define _GLCDCLUT60_BLUE_POSITION                0x00000000
#define _GLCDCLUT60_BLUE_MASK                    0x000000FF
#define _GLCDCLUT60_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT60_GREEN_POSITION               0x00000008
#define _GLCDCLUT60_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT60_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT60_RED_POSITION                 0x00000010
#define _GLCDCLUT60_RED_MASK                     0x00FF0000
#define _GLCDCLUT60_RED_LENGTH                   0x00000008

#define _GLCDCLUT61_BLUE_POSITION                0x00000000
#define _GLCDCLUT61_BLUE_MASK                    0x000000FF
#define _GLCDCLUT61_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT61_GREEN_POSITION               0x00000008
#define _GLCDCLUT61_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT61_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT61_RED_POSITION                 0x00000010
#define _GLCDCLUT61_RED_MASK                     0x00FF0000
#define _GLCDCLUT61_RED_LENGTH                   0x00000008

#define _GLCDCLUT62_BLUE_POSITION                0x00000000
#define _GLCDCLUT62_BLUE_MASK                    0x000000FF
#define _GLCDCLUT62_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT62_GREEN_POSITION               0x00000008
#define _GLCDCLUT62_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT62_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT62_RED_POSITION                 0x00000010
#define _GLCDCLUT62_RED_MASK                     0x00FF0000
#define _GLCDCLUT62_RED_LENGTH                   0x00000008

#define _GLCDCLUT63_BLUE_POSITION                0x00000000
#define _GLCDCLUT63_BLUE_MASK                    0x000000FF
#define _GLCDCLUT63_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT63_GREEN_POSITION               0x00000008
#define _GLCDCLUT63_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT63_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT63_RED_POSITION                 0x00000010
#define _GLCDCLUT63_RED_MASK                     0x00FF0000
#define _GLCDCLUT63_RED_LENGTH                   0x00000008

#define _GLCDCLUT64_BLUE_POSITION                0x00000000
#define _GLCDCLUT64_BLUE_MASK                    0x000000FF
#define _GLCDCLUT64_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT64_GREEN_POSITION               0x00000008
#define _GLCDCLUT64_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT64_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT64_RED_POSITION                 0x00000010
#define _GLCDCLUT64_RED_MASK                     0x00FF0000
#define _GLCDCLUT64_RED_LENGTH                   0x00000008

#define _GLCDCLUT65_BLUE_POSITION                0x00000000
#define _GLCDCLUT65_BLUE_MASK                    0x000000FF
#define _GLCDCLUT65_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT65_GREEN_POSITION               0x00000008
#define _GLCDCLUT65_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT65_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT65_RED_POSITION                 0x00000010
#define _GLCDCLUT65_RED_MASK                     0x00FF0000
#define _GLCDCLUT65_RED_LENGTH                   0x00000008

#define _GLCDCLUT66_BLUE_POSITION                0x00000000
#define _GLCDCLUT66_BLUE_MASK                    0x000000FF
#define _GLCDCLUT66_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT66_GREEN_POSITION               0x00000008
#define _GLCDCLUT66_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT66_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT66_RED_POSITION                 0x00000010
#define _GLCDCLUT66_RED_MASK                     0x00FF0000
#define _GLCDCLUT66_RED_LENGTH                   0x00000008

#define _GLCDCLUT67_BLUE_POSITION                0x00000000
#define _GLCDCLUT67_BLUE_MASK                    0x000000FF
#define _GLCDCLUT67_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT67_GREEN_POSITION               0x00000008
#define _GLCDCLUT67_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT67_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT67_RED_POSITION                 0x00000010
#define _GLCDCLUT67_RED_MASK                     0x00FF0000
#define _GLCDCLUT67_RED_LENGTH                   0x00000008

#define _GLCDCLUT68_BLUE_POSITION                0x00000000
#define _GLCDCLUT68_BLUE_MASK                    0x000000FF
#define _GLCDCLUT68_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT68_GREEN_POSITION               0x00000008
#define _GLCDCLUT68_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT68_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT68_RED_POSITION                 0x00000010
#define _GLCDCLUT68_RED_MASK                     0x00FF0000
#define _GLCDCLUT68_RED_LENGTH                   0x00000008

#define _GLCDCLUT69_BLUE_POSITION                0x00000000
#define _GLCDCLUT69_BLUE_MASK                    0x000000FF
#define _GLCDCLUT69_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT69_GREEN_POSITION               0x00000008
#define _GLCDCLUT69_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT69_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT69_RED_POSITION                 0x00000010
#define _GLCDCLUT69_RED_MASK                     0x00FF0000
#define _GLCDCLUT69_RED_LENGTH                   0x00000008

#define _GLCDCLUT70_BLUE_POSITION                0x00000000
#define _GLCDCLUT70_BLUE_MASK                    0x000000FF
#define _GLCDCLUT70_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT70_GREEN_POSITION               0x00000008
#define _GLCDCLUT70_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT70_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT70_RED_POSITION                 0x00000010
#define _GLCDCLUT70_RED_MASK                     0x00FF0000
#define _GLCDCLUT70_RED_LENGTH                   0x00000008

#define _GLCDCLUT71_BLUE_POSITION                0x00000000
#define _GLCDCLUT71_BLUE_MASK                    0x000000FF
#define _GLCDCLUT71_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT71_GREEN_POSITION               0x00000008
#define _GLCDCLUT71_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT71_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT71_RED_POSITION                 0x00000010
#define _GLCDCLUT71_RED_MASK                     0x00FF0000
#define _GLCDCLUT71_RED_LENGTH                   0x00000008

#define _GLCDCLUT72_BLUE_POSITION                0x00000000
#define _GLCDCLUT72_BLUE_MASK                    0x000000FF
#define _GLCDCLUT72_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT72_GREEN_POSITION               0x00000008
#define _GLCDCLUT72_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT72_GREEN_LENGTH                 0x00000008

