MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR176/mcu.h
#define _GLCDCLUT100_BLUE_POSITION               0x00000000
#define _GLCDCLUT100_BLUE_MASK                   0x000000FF
#define _GLCDCLUT100_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT100_GREEN_POSITION              0x00000008
#define _GLCDCLUT100_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT100_GREEN_LENGTH                0x00000008

#define _GLCDCLUT100_RED_POSITION                0x00000010
#define _GLCDCLUT100_RED_MASK                    0x00FF0000
#define _GLCDCLUT100_RED_LENGTH                  0x00000008

#define _GLCDCLUT101_BLUE_POSITION               0x00000000
#define _GLCDCLUT101_BLUE_MASK                   0x000000FF
#define _GLCDCLUT101_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT101_GREEN_POSITION              0x00000008
#define _GLCDCLUT101_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT101_GREEN_LENGTH                0x00000008

#define _GLCDCLUT101_RED_POSITION                0x00000010
#define _GLCDCLUT101_RED_MASK                    0x00FF0000
#define _GLCDCLUT101_RED_LENGTH                  0x00000008

#define _GLCDCLUT102_BLUE_POSITION               0x00000000
#define _GLCDCLUT102_BLUE_MASK                   0x000000FF
#define _GLCDCLUT102_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT102_GREEN_POSITION              0x00000008
#define _GLCDCLUT102_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT102_GREEN_LENGTH                0x00000008

#define _GLCDCLUT102_RED_POSITION                0x00000010
#define _GLCDCLUT102_RED_MASK                    0x00FF0000
#define _GLCDCLUT102_RED_LENGTH                  0x00000008

#define _GLCDCLUT103_BLUE_POSITION               0x00000000
#define _GLCDCLUT103_BLUE_MASK                   0x000000FF
#define _GLCDCLUT103_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT103_GREEN_POSITION              0x00000008
#define _GLCDCLUT103_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT103_GREEN_LENGTH                0x00000008

#define _GLCDCLUT103_RED_POSITION                0x00000010
#define _GLCDCLUT103_RED_MASK                    0x00FF0000
#define _GLCDCLUT103_RED_LENGTH                  0x00000008

#define _GLCDCLUT104_BLUE_POSITION               0x00000000
#define _GLCDCLUT104_BLUE_MASK                   0x000000FF
#define _GLCDCLUT104_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT104_GREEN_POSITION              0x00000008
#define _GLCDCLUT104_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT104_GREEN_LENGTH                0x00000008

#define _GLCDCLUT104_RED_POSITION                0x00000010
#define _GLCDCLUT104_RED_MASK                    0x00FF0000
#define _GLCDCLUT104_RED_LENGTH                  0x00000008

#define _GLCDCLUT105_BLUE_POSITION               0x00000000
#define _GLCDCLUT105_BLUE_MASK                   0x000000FF
#define _GLCDCLUT105_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT105_GREEN_POSITION              0x00000008
#define _GLCDCLUT105_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT105_GREEN_LENGTH                0x00000008

#define _GLCDCLUT105_RED_POSITION                0x00000010
#define _GLCDCLUT105_RED_MASK                    0x00FF0000
#define _GLCDCLUT105_RED_LENGTH                  0x00000008

#define _GLCDCLUT106_BLUE_POSITION               0x00000000
#define _GLCDCLUT106_BLUE_MASK                   0x000000FF
#define _GLCDCLUT106_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT106_GREEN_POSITION              0x00000008
#define _GLCDCLUT106_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT106_GREEN_LENGTH                0x00000008

#define _GLCDCLUT106_RED_POSITION                0x00000010
#define _GLCDCLUT106_RED_MASK                    0x00FF0000
#define _GLCDCLUT106_RED_LENGTH                  0x00000008

#define _GLCDCLUT107_BLUE_POSITION               0x00000000
#define _GLCDCLUT107_BLUE_MASK                   0x000000FF
#define _GLCDCLUT107_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT107_GREEN_POSITION              0x00000008
#define _GLCDCLUT107_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT107_GREEN_LENGTH                0x00000008

#define _GLCDCLUT107_RED_POSITION                0x00000010
#define _GLCDCLUT107_RED_MASK                    0x00FF0000
#define _GLCDCLUT107_RED_LENGTH                  0x00000008

#define _GLCDCLUT108_BLUE_POSITION               0x00000000
#define _GLCDCLUT108_BLUE_MASK                   0x000000FF
#define _GLCDCLUT108_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT108_GREEN_POSITION              0x00000008
#define _GLCDCLUT108_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT108_GREEN_LENGTH                0x00000008

#define _GLCDCLUT108_RED_POSITION                0x00000010
#define _GLCDCLUT108_RED_MASK                    0x00FF0000
#define _GLCDCLUT108_RED_LENGTH                  0x00000008

#define _GLCDCLUT109_BLUE_POSITION               0x00000000
#define _GLCDCLUT109_BLUE_MASK                   0x000000FF
#define _GLCDCLUT109_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT109_GREEN_POSITION              0x00000008
#define _GLCDCLUT109_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT109_GREEN_LENGTH                0x00000008

#define _GLCDCLUT109_RED_POSITION                0x00000010
#define _GLCDCLUT109_RED_MASK                    0x00FF0000
#define _GLCDCLUT109_RED_LENGTH                  0x00000008

#define _GLCDCLUT110_BLUE_POSITION               0x00000000
#define _GLCDCLUT110_BLUE_MASK                   0x000000FF
#define _GLCDCLUT110_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT110_GREEN_POSITION              0x00000008
#define _GLCDCLUT110_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT110_GREEN_LENGTH                0x00000008

#define _GLCDCLUT110_RED_POSITION                0x00000010
#define _GLCDCLUT110_RED_MASK                    0x00FF0000
#define _GLCDCLUT110_RED_LENGTH                  0x00000008

#define _GLCDCLUT111_BLUE_POSITION               0x00000000
#define _GLCDCLUT111_BLUE_MASK                   0x000000FF
#define _GLCDCLUT111_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT111_GREEN_POSITION              0x00000008
#define _GLCDCLUT111_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT111_GREEN_LENGTH                0x00000008

