MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAR176/mcu.h
#define _UBADEVCFG0_DBGPER_POSITION              0x0000000C
#define _UBADEVCFG0_DBGPER_MASK                  0x00007000
#define _UBADEVCFG0_DBGPER_LENGTH                0x00000003

#define _UBADEVCFG0_SMCLR_POSITION               0x0000000F
#define _UBADEVCFG0_SMCLR_MASK                   0x00008000
#define _UBADEVCFG0_SMCLR_LENGTH                 0x00000001

#define _UBADEVCFG0_SOSCGAIN_POSITION            0x00000010
#define _UBADEVCFG0_SOSCGAIN_MASK                0x00030000
#define _UBADEVCFG0_SOSCGAIN_LENGTH              0x00000002

#define _UBADEVCFG0_SOSCBOOST_POSITION           0x00000012
#define _UBADEVCFG0_SOSCBOOST_MASK               0x00040000
#define _UBADEVCFG0_SOSCBOOST_LENGTH             0x00000001

#define _UBADEVCFG0_POSCGAIN_POSITION            0x00000013
#define _UBADEVCFG0_POSCGAIN_MASK                0x00180000
#define _UBADEVCFG0_POSCGAIN_LENGTH              0x00000002

#define _UBADEVCFG0_POSCBOOST_POSITION           0x00000015
#define _UBADEVCFG0_POSCBOOST_MASK               0x00200000
#define _UBADEVCFG0_POSCBOOST_LENGTH             0x00000001

#define _UBADEVCFG0_POSCFGAIN_POSITION           0x00000016
#define _UBADEVCFG0_POSCFGAIN_MASK               0x00C00000
#define _UBADEVCFG0_POSCFGAIN_LENGTH             0x00000002

#define _UBADEVCFG0_POSCTYPE_POSITION            0x00000018
#define _UBADEVCFG0_POSCTYPE_MASK                0x03000000
#define _UBADEVCFG0_POSCTYPE_LENGTH              0x00000002

#define _UBADEVCFG0_POSCAGCRNG_POSITION          0x0000001A
#define _UBADEVCFG0_POSCAGCRNG_MASK              0x04000000
#define _UBADEVCFG0_POSCAGCRNG_LENGTH            0x00000001

#define _UBADEVCFG0_POSCAGC_POSITION             0x0000001B
#define _UBADEVCFG0_POSCAGC_MASK                 0x08000000
#define _UBADEVCFG0_POSCAGC_LENGTH               0x00000001

#define _UBADEVCFG0_EJTAGBEN_POSITION            0x0000001E
#define _UBADEVCFG0_EJTAGBEN_MASK                0x40000000
#define _UBADEVCFG0_EJTAGBEN_LENGTH              0x00000001

#define _UBADEVCFG0_POSCAGCDLY_POSITION          0x00000018
#define _UBADEVCFG0_POSCAGCDLY_MASK              0x03000000
#define _UBADEVCFG0_POSCAGCDLY_LENGTH            0x00000002

#define _UBADEVCFG0_FDEBUG_POSITION              0x00000000
#define _UBADEVCFG0_FDEBUG_MASK                  0x00000003
#define _UBADEVCFG0_FDEBUG_LENGTH                0x00000002

#define _UBADEVCFG0_w_POSITION                   0x00000000
#define _UBADEVCFG0_w_MASK                       0xFFFFFFFF
#define _UBADEVCFG0_w_LENGTH                     0x00000020

#define _UBADEVCP0_CP_POSITION                   0x0000001C
#define _UBADEVCP0_CP_MASK                       0x10000000
#define _UBADEVCP0_CP_LENGTH                     0x00000001

#define _UBADEVCP0_w_POSITION                    0x00000000
#define _UBADEVCP0_w_MASK                        0xFFFFFFFF
#define _UBADEVCP0_w_LENGTH                      0x00000020

#define _UBASEQ3_TSEQ_POSITION                   0x00000000
#define _UBASEQ3_TSEQ_MASK                       0x0000FFFF
#define _UBASEQ3_TSEQ_LENGTH                     0x00000010

#define _UBASEQ3_CSEQ_POSITION                   0x00000010
#define _UBASEQ3_CSEQ_MASK                       0xFFFF0000
#define _UBASEQ3_CSEQ_LENGTH                     0x00000010

#define _UBASEQ3_w_POSITION                      0x00000000
#define _UBASEQ3_w_MASK                          0xFFFFFFFF
#define _UBASEQ3_w_LENGTH                        0x00000020

#define _ABF1DEVCFG4_SWDTPS_POSITION             0x00000018
#define _ABF1DEVCFG4_SWDTPS_MASK                 0x1F000000
#define _ABF1DEVCFG4_SWDTPS_LENGTH               0x00000005

#define _ABF1DEVCFG4_w_POSITION                  0x00000000
#define _ABF1DEVCFG4_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG4_w_LENGTH                    0x00000020

#define _ABF1DEVCFG3_USERID_POSITION             0x00000000
#define _ABF1DEVCFG3_USERID_MASK                 0x0000FFFF
#define _ABF1DEVCFG3_USERID_LENGTH               0x00000010

#define _ABF1DEVCFG3_FMIIEN_POSITION             0x00000018
#define _ABF1DEVCFG3_FMIIEN_MASK                 0x01000000
#define _ABF1DEVCFG3_FMIIEN_LENGTH               0x00000001

#define _ABF1DEVCFG3_FETHIO_POSITION             0x00000019
#define _ABF1DEVCFG3_FETHIO_MASK                 0x02000000
#define _ABF1DEVCFG3_FETHIO_LENGTH               0x00000001

#define _ABF1DEVCFG3_PGL1WAY_POSITION            0x0000001B
#define _ABF1DEVCFG3_PGL1WAY_MASK                0x08000000
#define _ABF1DEVCFG3_PGL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_PMDL1WAY_POSITION           0x0000001C
#define _ABF1DEVCFG3_PMDL1WAY_MASK               0x10000000
#define _ABF1DEVCFG3_PMDL1WAY_LENGTH             0x00000001

#define _ABF1DEVCFG3_IOL1WAY_POSITION            0x0000001D
#define _ABF1DEVCFG3_IOL1WAY_MASK                0x20000000
#define _ABF1DEVCFG3_IOL1WAY_LENGTH              0x00000001

#define _ABF1DEVCFG3_w_POSITION                  0x00000000
#define _ABF1DEVCFG3_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG3_w_LENGTH                    0x00000020

#define _ABF1DEVCFG2_FPLLIDIV_POSITION           0x00000000
#define _ABF1DEVCFG2_FPLLIDIV_MASK               0x00000007
#define _ABF1DEVCFG2_FPLLIDIV_LENGTH             0x00000003

#define _ABF1DEVCFG2_FPLLRNG_POSITION            0x00000004
#define _ABF1DEVCFG2_FPLLRNG_MASK                0x00000070
#define _ABF1DEVCFG2_FPLLRNG_LENGTH              0x00000003

#define _ABF1DEVCFG2_FPLLICLK_POSITION           0x00000007
#define _ABF1DEVCFG2_FPLLICLK_MASK               0x00000080
#define _ABF1DEVCFG2_FPLLICLK_LENGTH             0x00000001

#define _ABF1DEVCFG2_FPLLMULT_POSITION           0x00000008
#define _ABF1DEVCFG2_FPLLMULT_MASK               0x00007F00
#define _ABF1DEVCFG2_FPLLMULT_LENGTH             0x00000007

#define _ABF1DEVCFG2_FPLLODIV_POSITION           0x00000010
#define _ABF1DEVCFG2_FPLLODIV_MASK               0x00070000
#define _ABF1DEVCFG2_FPLLODIV_LENGTH             0x00000003

#define _ABF1DEVCFG2_VBATBOREN_POSITION          0x00000013
#define _ABF1DEVCFG2_VBATBOREN_MASK              0x00080000
#define _ABF1DEVCFG2_VBATBOREN_LENGTH            0x00000001

#define _ABF1DEVCFG2_DSBOREN_POSITION            0x00000014
#define _ABF1DEVCFG2_DSBOREN_MASK                0x00100000
#define _ABF1DEVCFG2_DSBOREN_LENGTH              0x00000001

#define _ABF1DEVCFG2_DSWDTPS_POSITION            0x00000015
#define _ABF1DEVCFG2_DSWDTPS_MASK                0x03E00000
#define _ABF1DEVCFG2_DSWDTPS_LENGTH              0x00000005

#define _ABF1DEVCFG2_DSWDTOSC_POSITION           0x0000001A
#define _ABF1DEVCFG2_DSWDTOSC_MASK               0x04000000
#define _ABF1DEVCFG2_DSWDTOSC_LENGTH             0x00000001

#define _ABF1DEVCFG2_DSWDTEN_POSITION            0x0000001B
#define _ABF1DEVCFG2_DSWDTEN_MASK                0x08000000
#define _ABF1DEVCFG2_DSWDTEN_LENGTH              0x00000001

#define _ABF1DEVCFG2_FDSEN_POSITION              0x0000001C
#define _ABF1DEVCFG2_FDSEN_MASK                  0x10000000
#define _ABF1DEVCFG2_FDSEN_LENGTH                0x00000001

#define _ABF1DEVCFG2_UPLLFSEL_POSITION           0x0000001E
#define _ABF1DEVCFG2_UPLLFSEL_MASK               0x40000000
#define _ABF1DEVCFG2_UPLLFSEL_LENGTH             0x00000001

#define _ABF1DEVCFG2_w_POSITION                  0x00000000
#define _ABF1DEVCFG2_w_MASK                      0xFFFFFFFF
#define _ABF1DEVCFG2_w_LENGTH                    0x00000020

#define _ABF1DEVCFG1_FNOSC_POSITION              0x00000000
#define _ABF1DEVCFG1_FNOSC_MASK                  0x00000007
#define _ABF1DEVCFG1_FNOSC_LENGTH                0x00000003

#define _ABF1DEVCFG1_DMTINTV_POSITION            0x00000003
#define _ABF1DEVCFG1_DMTINTV_MASK                0x00000038
#define _ABF1DEVCFG1_DMTINTV_LENGTH              0x00000003

